console.log(`
--Вёрстка валидная (10/10)
----Для проверки валидности вёрстки используйте сервис https://validator.w3.org/\n
валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show." В таком случае баллы за пункт требований выставляем полностью.
если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований
\n\n
--Вёрстка семантическая (20/20)
\n---В коде странице присутствуют следующие элементы (указано минимальное количество, может быть больше):
\n----<header>, <main>, <footer> (3)
\n----Четыре элемента <section> (по количеству секций) (3)
\n----Только один заголовок <h1> (3)
\n----Три заголовка <h2> (количество секций минус одна, у которой заголовок <h1>) (3)
\n----Один элемент <nav> (панель навигации) (3)
\n----Два списка ul > li > a (панель навигации, ссылки на соцсети) (3)
\n----Четыре кнопки <button> (2)
\n\n
--Вёрстка соответствует макету (48/48)
\n----Блок <header> (6)
\n----Секция preview (9)
\n----Секция steps (9)
\n----Секция destinations (9)
\n----Секция stories (9)
\n----Блок <footer> (6)
\n\n
--Требования к css (12/12)
\n----Для построения сетки используются флексы или гриды (2)
\n----При уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону (2)
\n----Фоновый цвет тянется на всю ширину страницы (0)
\n----Иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на \n----способ добавления (2)
\n----Изображения добавлены в формате .jpg (2)
\n----Eсть favicon (2)
\n\n
--Интерактивность, реализуемая через css: (20/20)
\n----Плавная прокрутка по якорям (5)
\n----Ссылки в футере ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/ (5)
\n----Интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета (5)
\n----Обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не ----влияющее на соседние элементы (5)
\n\n\n
ИТОГО: 108/100.
`);